stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
#define HAL_CCB_GET_FLAG(__HANDLE__, __FLAG__)                  (((((__HANDLE__)->Instance->SR)\
                                                                   & (__FLAG__)) == (__FLAG__)) ? SET : RESET)

#define HAL_CCB_GET_SAES_FLAG(__FLAG__)           (((__FLAG__)>1U)  ?                    \
                                                   (((SAES->SR & (__FLAG__)) == (__FLAG__)) ? SET : RESET) :\
                                                   (((SAES->ISR & (__FLAG__)) == (__FLAG__)) ? SET : RESET) )

#define HAL_CCB_GET_PKA_FLAG(__FLAG__)              ((((PKA->SR)\
                                                       & (__FLAG__)) == (__FLAG__)) ? SET : RESET)

#define HAL_CCB_CLEAR_PKA_FLAG(__FLAG__)            WRITE_REG(PKA->CLRFR, (__FLAG__))

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Polling Private function */
static HAL_StatusTypeDef CCB_WaitOperStep(CCB_HandleTypeDef *hccb, uint32_t step, uint32_t Timeout);
static HAL_StatusTypeDef CCB_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, uint32_t Timeout);
static HAL_StatusTypeDef Protect_PKA_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, uint32_t Timeout);
static HAL_StatusTypeDef Unprotect_PKA_WaitFLAG(uint32_t flag, uint32_t Timeout);
static HAL_StatusTypeDef CCB_RNG_Wait_SET_FLAG(uint32_t flag, uint32_t Timeout);
static HAL_StatusTypeDef Protect_SAES_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, FlagStatus Status,
                                               uint32_t Timeout);

/* Set parameters Private function */
static HAL_StatusTypeDef CCB_ECDSASign_SetPram(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *in);
static HAL_StatusTypeDef CCB_ECCMul_SetPram(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *in);
static HAL_StatusTypeDef CCB_RSAModExp_SetPram(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *in);
static HAL_StatusTypeDef CCB_SetPram(CCB_HandleTypeDef *hccb, uint32_t modulusSizeByte, uint32_t dst_address,
                                     const uint8_t *src);

/* Initialization Private function */
static HAL_StatusTypeDef Protect_PKA_Init(CCB_HandleTypeDef *hccb, uint32_t Operation);
static HAL_StatusTypeDef Unprotected_PKA_Init(void);
static HAL_StatusTypeDef CCB_RNG_Init(void);

/* Wrapping Private function */
static HAL_StatusTypeDef WrappingKeyConfiguration(CCB_HandleTypeDef *hccb, uint32_t Operation,
                                                  CCB_WrappingKeyTypeDef *pWrappingKey);
static HAL_StatusTypeDef Protect_SAES_UnwrapKey(CCB_HandleTypeDef *hccb, const CCB_WrappingKeyTypeDef *pWrappingKey,
                                                uint32_t Timeout);

/* Data managementPrivate function */
static uint32_t GetOptBitSize_u8(uint32_t byteNumber, uint8_t msb);
static void CCB_Memcpy_u8_to_u32(__IO uint32_t dst[], const uint8_t src[], size_t size);
static void CCB_Memcpy_u32_to_u8(uint8_t dst[], __IO const uint32_t src[], size_t n);
static void CCB_Memcpy_u32_to_u32(__IO uint32_t dst[], __IO const uint32_t src[], size_t n);
static void CCB_Memcpy_u8_to_u64(__IO uint32_t dst[], const uint8_t src[]);
static void CCB_Memcpy_Not_Align(__IO uint32_t dst[], const uint8_t src[], size_t size);
static uint32_t CCB_get_cipherkey_size(CCB_ECDSACurveParamTypeDef *pCurveParam);

/* Blob processing Private function */
static HAL_StatusTypeDef CCB_WrapSymmetricKey(CCB_HandleTypeDef *hccb, const uint32_t *pClearAESKey, uint32_t operation,
                                              CCB_WrappingKeyTypeDef *pWrappingKey);
static HAL_StatusTypeDef CCB_BlobCreation_InitialPhase(CCB_HandleTypeDef *hccb, uint32_t *IV);
static HAL_StatusTypeDef CCB_BlobUse_InitialPhase(CCB_HandleTypeDef *hccb, const uint32_t *pIV, uint32_t *pTag);
static HAL_StatusTypeDef CCB_BlobCreation_FinalPhase(CCB_HandleTypeDef *hccb, uint32_t Operation, uint32_t *pTag,
                                                     uint32_t sizeparam);
static HAL_StatusTypeDef CCB_BlobUse_FinalPhase(CCB_HandleTypeDef *hccb, uint32_t Operation, uint32_t sizeparam);
static HAL_StatusTypeDef CCB_ECDSA_SignBlobCreation(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                                    const uint8_t *pClearPrivateKey,
                                                    CCB_WrappingKeyTypeDef *pWrappingKey,
                                                    uint32_t *pIV, uint32_t *pTag, uint32_t *pWarappedKey,
                                                    uint8_t CCB_Operation);
static HAL_StatusTypeDef CCB_ECC_ScalarMulBlobCreation(CCB_HandleTypeDef *hccb,
                                                       CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                       const uint8_t *pClearPrivateKey,
                                                       CCB_WrappingKeyTypeDef *pWrappingKey,
                                                       uint32_t *pIV, uint32_t *pTag, uint32_t *pWarappedKey,
                                                       uint8_t CCB_Operation);
static HAL_StatusTypeDef CCB_ECC_ComputeScalarMul(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                  CCB_WrappingKeyTypeDef *pWrappingKey,
                                                  uint32_t *pIV, uint32_t *pTag, uint32_t *pWarappedKey,
                                                  CCB_ECCMulPointTypeDef *pInputPoint,
                                                  CCB_ECCMulPointTypeDef *pOutputPoint,
                                                  const uint32_t *pPublicKey,
                                                  uint8_t VerifOperation);
static HAL_StatusTypeDef CCB_RSA_ExpBlobCreation(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                 const CCB_RSAClearKeyTypeDef *pRSAClearPrivateKey,
                                                 CCB_WrappingKeyTypeDef *pWrappingKey, uint32_t *pIV,
                                                 uint32_t *pTag, uint32_t *pWrappedExp, uint32_t *pWrappedPhi);
static HAL_StatusTypeDef CCB_RSA_ComputeModularExp(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                   CCB_WrappingKeyTypeDef *pWrappingKey, uint32_t *pIV,
                                                   uint32_t *pTag, uint32_t *pWrappedExp, uint32_t *pWrappedPhi,
                                                   const uint8_t *pOperand, uint8_t *pModularExp,
                                                   const uint32_t *pReferenceModularExp, uint8_t VerifOperation);
static HAL_StatusTypeDef PKA_ECDSASign(CCB_ECDSACurveParamTypeDef *pCurveParam,
                                       const uint8_t *pClearPrivateKey, uint8_t *pInteger, uint8_t *pHash,
                                       CCB_ECDSASignTypeDef *pSignature);

