stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  /* Export created Blob */
  key_size = CCB_get_cipherkey_size(pCurveParam);
  for (count = 0U; count < key_size; count++)
  {
    if (count < CCB_BLOCK_SIZE)
    {
      pWrappedPrivateKeyBlob->pIV[count] = iv_temp[count];
      pWrappedPrivateKeyBlob->pTag[count] = tag_temp[count];
    }
    pWrappedPrivateKeyBlob->pWrappedKey[count] = wrapped_key_temp[count];
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Creation: ECDSA generate (by RNG) and wrap the private Key (no user input).
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECDSA_GenerateWrapPrivateKey(CCB_HandleTypeDef *hccb,
                                                       CCB_ECDSACurveParamTypeDef *pCurveParam,
                                                       CCB_WrappingKeyTypeDef *pWrappingKey,
                                                       CCB_ECDSAKeyBlobTypeDef *pWrappedPrivateKeyBlob)
{
  uint32_t count;
  uint32_t key_size;
  uint32_t iv_temp[4] = {0};
  uint32_t tag_temp[4] = {0};
  uint32_t wrapped_key_temp[80U] = {0};

  if (hccb->State == HAL_CCB_STATE_READY)
  {

    /* Signature blob creation */
    if (CCB_ECDSA_SignBlobCreation(hccb, pCurveParam, NULL, pWrappingKey, iv_temp, tag_temp, wrapped_key_temp,
                                   CCB_ECDSA_SIGN_RNG_BLOB_CREATION) != HAL_OK)
    {
      /* Set state, error code and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
  }
  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Export created Blob */
  key_size = CCB_get_cipherkey_size(pCurveParam);
  for (count = 0U; count < key_size; count++)
  {
    if (count < CCB_BLOCK_SIZE)
    {
      pWrappedPrivateKeyBlob->pIV[count] = iv_temp[count];
      pWrappedPrivateKeyBlob->pTag[count] = tag_temp[count];
    }
    pWrappedPrivateKeyBlob->pWrappedKey[count] = wrapped_key_temp[count];
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECDSA Signature.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @param  pHash pointer to the Hash.
  * @param  pSignature pointer to the signature.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_ECDSA_Sign(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                     CCB_WrappingKeyTypeDef *pWrappingKey,
                                     CCB_ECDSAKeyBlobTypeDef *pWrappedPrivateKeyBlob, const uint8_t *pHash,
                                     CCB_ECDSASignTypeDef *pSignature)

{
  uint32_t count;
  uint32_t count_block = 0;
  uint32_t offset;
  uint32_t operand_size;
  uint32_t cipherkey_size;

  if (hccb->State == HAL_CCB_STATE_READY)
  {
    /* Set Operation in CCB */
    MODIFY_REG(CCB->CR, CCB_CR_CCOP, CCB_ECDSA_SIGN_BLOB_USE);

    /* Wait until OPSTEP is set to 0x01 */
    if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Initialize RNG */
    if (CCB_RNG_Init() != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /* Initialize PKA */
    if (Protect_PKA_Init(hccb, CCB_ECDSA_SIGN_BLOB_USE) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /*  Initialize SAES */
    if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* Disable the SAES peripheral */
      SAES->CR &=  ~AES_CR_EN;

      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /* Update the state */
    hccb->State = HAL_CCB_STATE_BUSY;

    /* Wrapping Key configuration */
    if (WrappingKeyConfiguration(hccb, CCB_ECDSA_SIGN_BLOB_USE, pWrappingKey) != HAL_OK)
    {
      /* Set state, error code and return error */
      return HAL_ERROR;
    }

    /* Wait until OPSTEP is set to 0x012 */
    if (CCB_WaitOperStep(hccb, 0x012, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Update the state */
    hccb->State = HAL_CCB_STATE_BUSY;

    /* set operand size (in word 32bits)*/

    operand_size = 2UL * ((uint32_t)(((pCurveParam->modulusSizeByte) + 7UL) / 8UL) + 1UL);

    if ((operand_size % 4UL) != 0UL)
    {
      cipherkey_size = operand_size - 2UL;
    }
    else
    {
      cipherkey_size = operand_size;
    }

    /* Set Hash message */
    CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_SIGN_IN_HASH_E ], pHash, pCurveParam->modulusSizeByte);

    /* Initial Phase Processing */
    if (CCB_BlobUse_InitialPhase(hccb, pWrappedPrivateKeyBlob->pIV, pWrappedPrivateKeyBlob->pTag) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Wait until OPSTEP is set to 0x13 */
    if (CCB_WaitOperStep(hccb, 0x13, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Set ECDSA parameters */
    if (CCB_ECDSASign_SetPram(hccb, pCurveParam) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x13 --> 0x14 */
    MODIFY_REG(SAES->CR, AES_CR_GCMPH, AES_CR_GCMPH_1);

    /* Wait until OPSTEP is set to 0x14 */
    if (CCB_WaitOperStep(hccb, 0x14, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Write encrypted Key*/
    for (offset = 0UL; offset < cipherkey_size; offset++)
    {
      WRITE_REG(SAES->DINR, pWrappedPrivateKeyBlob->pWrappedKey[cipherkey_size - (offset + 1UL)]);

      if ((offset % 4UL) == 0x3UL)
      {
        /* Wait until CCF flag is SET in SAES */
        if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
        {
          /* return error */
          return HAL_ERROR;
        }

