stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  /* set operand size */
  operand_size   = 2UL * ((uint32_t)(((pParam->modulusSizeByte) + 7UL) / 8UL) + 1UL);
  if ((operand_size % 4UL) != 0UL)
  {
    cipherkey_size = operand_size - 2UL;
  }
  else
  {
    cipherkey_size = operand_size;
  }

  /* Export created Blob */
  for (count = 0U; count < cipherkey_size; count++)
  {
    if (count < CCB_BLOCK_SIZE)
    {
      pWrappedPrivateKeyBlob->pIV[count] = iv_temp[count];
      pWrappedPrivateKeyBlob->pTag[count] = tag_temp[count];
    }
    pWrappedPrivateKeyBlob->pWrappedExp[count] = wrapped_exp[count];
    pWrappedPrivateKeyBlob->pWrappedPhi[count] = wrapped_phi[count];
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Usage: RSA Compute Modular exponentiation.
  * @param  hccb CCB handle.
  * @param  pParam pointer to the modular exponatiation parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pOperand pointer to the operand.
  * @param  pWrappedPrivateKeyBlob pointer to the related wrapped Private Key Blob.
  * @param  pModularExp pointer to the output operation.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_CCB_RSA_ComputeModularExp(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *pParam,
                                                CCB_WrappingKeyTypeDef *pWrappingKey,
                                                CCB_RSAKeyBlobTypeDef *pWrappedPrivateKeyBlob,
                                                const uint8_t *pOperand, uint8_t *pModularExp)
{
  if (hccb->State == HAL_CCB_STATE_READY)
  {
    if (CCB_RSA_ComputeModularExp(hccb, pParam, pWrappingKey, pWrappedPrivateKeyBlob->pIV,
                                  pWrappedPrivateKeyBlob->pTag, pWrappedPrivateKeyBlob->pWrappedExp,
                                  pWrappedPrivateKeyBlob->pWrappedPhi, pOperand,
                                  pModularExp, NULL, CCB_VERIF_OPERATION_DISABLED) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Processing Error callback. Infinite loop against intrusion.
  * @param  hccb : CCB handle
  * @retval None
  */
__weak void HAL_CCB_IntrusionCallback(CCB_HandleTypeDef *hccb)
{
  for (;;)
  {
    NVIC_SystemReset();
  }

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_CCB_IntrusionCallback could be implemented in the user file
   */
}
/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  Wait CCB Operation step
  * @param  hccb CCB handle
  * @param  step ctep to wait
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_WaitOperStep(CCB_HandleTypeDef *hccb, uint32_t step, uint32_t Timeout)
{
  uint32_t tickstart;

  tickstart = HAL_GetTick();

  /* Wait until OPSTEP is set */
  while ((READ_REG(hccb->Instance->SR) & step) != step)
  {
    /* Check for the Timeout */
    if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Wait CCB Flag
  * @param  hccb CCB handle
  * @param  flag Specifies the flag to check
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, uint32_t Timeout)
{
  uint32_t tickstart = HAL_GetTick();

  while (HAL_IS_BIT_SET(hccb->Instance->SR, flag))
  {
    if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Wait PKA Flag
  * @param  hccb CCB handle
  * @param  flag Specifies the flag to check
  * @param  Timeout Timeout duration
  * @retval HAL status.
  */
static HAL_StatusTypeDef Protect_PKA_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, uint32_t Timeout)
{
  uint32_t tickstart = HAL_GetTick();

  while (HAL_IS_BIT_CLR(PKA->SR, flag))
  {
    if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
    {
      CLEAR_BIT(PKA->CR, PKA_CR_EN);

      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
  }

  /* Clear flag */
  SET_BIT(PKA->CLRFR, flag);

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Wait PKA Flag
  * @param  flag Specifies the flag to check
  * @param  Timeout Timeout duration
  * @retval HAL status.
  */
static HAL_StatusTypeDef Unprotect_PKA_WaitFLAG(uint32_t flag, uint32_t Timeout)
{
  uint32_t tickstart = HAL_GetTick();

  while (HAL_IS_BIT_CLR(PKA->SR, flag))
  {
    if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
    {
      CLEAR_BIT(PKA->CR, PKA_CR_EN);

      /* return error */
      return HAL_ERROR;
    }
  }

  /* Clear flag */
  SET_BIT(PKA->CLRFR, flag);

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Wait RNG Flag
  * @param  flag Specifies the flag to check
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_RNG_Wait_SET_FLAG(uint32_t flag, uint32_t Timeout)
{
  uint32_t tickstart = HAL_GetTick();

  while (HAL_IS_BIT_CLR(RNG->SR, flag))
  {
    if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
    {
      RNG->CR &= ~RNG_CR_RNGEN;

      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Wait SAES Flag
  * @param  hccb CCB handle
  * @param  flag Specifies the flag to check
  * @param  Status Flag status (SET or RESET)
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
static HAL_StatusTypeDef Protect_SAES_WaitFLAG(CCB_HandleTypeDef *hccb, uint32_t flag, FlagStatus Status,
                                               uint32_t Timeout)
{
  uint32_t tickstart = HAL_GetTick();

  while (HAL_CCB_GET_SAES_FLAG(flag) != Status)
  {
    if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
    {
      SAES->CR &= ~AES_CR_EN;

      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
  }

  /* Clear flag */
  SET_BIT(SAES->ICR, flag);


  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Set ECDSA signture parameters in related PKA RAM address
  * @param  hccb CCB handle
  * @param  in pointer to the ECDSA signture parametersstructure
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_ECDSASign_SetPram(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *in)
{
  /* Get the prime order n length */
  PKA->RAM[PKA_ECDSA_SIGN_IN_ORDER_NB_BITS]
    = GetOptBitSize_u8(in->primeOrderSizeByte, *(in->pPrimeOrder));
  PKA->RAM[PKA_ECDSA_SIGN_IN_ORDER_NB_BITS + 1U] = 0x0U;
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Get the modulus p length */
  PKA->RAM[PKA_ECDSA_SIGN_IN_MOD_NB_BITS] = GetOptBitSize_u8(in->modulusSizeByte, *(in->pModulus));
  PKA->RAM[PKA_ECDSA_SIGN_IN_MOD_NB_BITS + 1U] = 0x0U;
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Get the coefficient a sign */
  PKA->RAM[PKA_ECDSA_SIGN_IN_A_COEFF_SIGN] = in->coefSignA;
  PKA->RAM[PKA_ECDSA_SIGN_IN_A_COEFF_SIGN + 1U] = 0x0;
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Move the input parameters coefficient |a| to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECDSA_SIGN_IN_A_COEFF, in->pAbsCoefA) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters coefficient B to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECDSA_SIGN_IN_B_COEFF, in->pCoefB) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters modulus value p to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECDSA_SIGN_IN_MOD_GF, in->pModulus) != HAL_OK)
  {
    return HAL_ERROR;
  }

