stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  /* Move the input parameters prime order n to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECDSA_SIGN_IN_ORDER_N, in->pPrimeOrder) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters base point G coordinate x to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECDSA_SIGN_IN_INITIAL_POINT_X, in->pPointX) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters base point G coordinate y to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECDSA_SIGN_IN_INITIAL_POINT_Y, in->pPointY) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Set ECC scalar multiplication parameters in related PKA RAM address
  * @param  hccb CCB handle
  * @param  in pointer to the ECC parametersstructure
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_ECCMul_SetPram(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *in)
{
  /* Get the prime order n length */
  PKA->RAM[PKA_ECC_SCALAR_MUL_IN_EXP_NB_BITS]
    = GetOptBitSize_u8(in->primeOrderSizeByte, *(in->pPrimeOrder));
  PKA->RAM[PKA_ECC_SCALAR_MUL_IN_EXP_NB_BITS + 1U] = 0x0;
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Get the modulus p length */
  PKA->RAM[PKA_ECC_SCALAR_MUL_IN_OP_NB_BITS] = GetOptBitSize_u8(in->modulusSizeByte, *(in->pModulus));
  PKA->RAM[PKA_ECC_SCALAR_MUL_IN_OP_NB_BITS + 1U] = 0x0;
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Get the coefficient a sign */
  PKA->RAM[PKA_ECC_SCALAR_MUL_IN_A_COEFF_SIGN] = in->coefSignA;
  PKA->RAM[PKA_ECC_SCALAR_MUL_IN_A_COEFF_SIGN + 1U] = 0x0;
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Move the input parameters coefficient |a| to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECC_SCALAR_MUL_IN_A_COEFF, in->pAbsCoefA) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters coefficient B to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECC_SCALAR_MUL_IN_B_COEFF, in->pCoefB) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters modulus value p to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECC_SCALAR_MUL_IN_MOD_GF, in->pModulus) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Move the input parameters prime order n to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_ECC_SCALAR_MUL_IN_N_PRIME_ORDER, in->pPrimeOrder) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Set RSA sModular Exponentiation parameters in related PKA RAM address
  * @param  hccb CCB handle
  * @param  in pointer to the ECC parametersstructure
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_RSAModExp_SetPram(CCB_HandleTypeDef *hccb, CCB_RSAParamTypeDef *in)
{
  /* Get the exp length */
  PKA->RAM[PKA_MODULAR_EXP_IN_EXP_NB_BITS] = GetOptBitSize_u8(in->expSizeByte, *(in->pMod));
  PKA->RAM[PKA_MODULAR_EXP_IN_EXP_NB_BITS + 1U] = 0x0U;
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Get the modulus n length */
  PKA->RAM[PKA_MODULAR_EXP_IN_OP_NB_BITS] = GetOptBitSize_u8(in->modulusSizeByte, *(in->pMod));
  PKA->RAM[PKA_MODULAR_EXP_IN_OP_NB_BITS + 1U] = 0x0U;
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Move the input parameters modulus to PKA RAM */
  if (CCB_SetPram(hccb, in->modulusSizeByte, PKA_MODULAR_EXP_PROTECT_IN_MODULUS, in->pMod) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Set CCB parameters
  * @param  hccb CCB handle
  * @param  modulusSizeByte Modulus size in byte
  * @param  dst_address destination address
  * @param  src Pointer to source
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_SetPram(CCB_HandleTypeDef *hccb, uint32_t modulusSizeByte, uint32_t dst_address,
                                     const uint8_t *src)
{
  uint32_t offset;
  uint32_t operand_size;
  operand_size = 2UL * ((uint32_t)(((modulusSizeByte) + 7UL) / 8UL) + 1UL);

  if ((modulusSizeByte % 8UL) != 0UL)
  {
    for (offset = 0; offset < (operand_size - 4UL); offset += 2UL)
    {
      CCB_Memcpy_u8_to_u64(&PKA->RAM[dst_address + offset],
                           &src[(modulusSizeByte) - ((offset * 4UL) + 1UL)]);
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        hccb->State = HAL_CCB_STATE_ERROR;
        return HAL_ERROR;
      }
    }

    CCB_Memcpy_Not_Align(&PKA->RAM[dst_address + offset],
                         &src[(modulusSizeByte) - ((offset * 4UL) + 1UL)], modulusSizeByte % 8UL);

    if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
    RAM_PARAM_END(PKA->RAM, dst_address + ((modulusSizeByte + 7UL) / 4UL));
    if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
  }

  else
  {
    for (offset = 0; offset < (operand_size - 2UL); offset += 2UL)
    {
      CCB_Memcpy_u8_to_u64(&PKA->RAM[dst_address + offset],
                           &src[(modulusSizeByte) - ((offset * 4UL) + 1UL)]);
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        hccb->State = HAL_CCB_STATE_ERROR;
        return HAL_ERROR;
      }
    }

    RAM_PARAM_END(PKA->RAM, dst_address
                  + ((modulusSizeByte + 3UL) / 4UL));
    if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Initialize the PKA
  * @param  hccb CCB handle
  * @param  Operation PKA Operation
  * @retval HAL status
  */
static HAL_StatusTypeDef Protect_PKA_Init(CCB_HandleTypeDef *hccb, uint32_t Operation)
{
  /* Reset the control register and enable the PKA */
  PKA->CR = PKA_CR_EN;

