stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  /* Wait the INITOK flag Setting */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_INITOK, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Reset any pending flag */
  SET_BIT(PKA->CLRFR, PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  /* Set the mode and deactivate the interrupts */
  if ((Operation == CCB_ECDSA_SIGN_CPU_BLOB_CREATION)
      || (Operation == CCB_ECDSA_SIGN_RNG_BLOB_CREATION)
      || (Operation == CCB_ECDSA_SIGN_BLOB_USE))
  {
    MODIFY_REG(PKA->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE
               | PKA_CR_OPERRIE, CCB_PKA_ECDSA_SIGNATURE_MODE << PKA_CR_MODE_Pos);
  }

  else if ((Operation == CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION)
           || (Operation == CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION)
           || (Operation == CCB_ECC_SCALAR_MUL_BLOB_USE))
  {
    MODIFY_REG(PKA->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE
               | PKA_CR_OPERRIE, CCB_PKA_ECC_MUL_MODE << PKA_CR_MODE_Pos);
  }

  else if ((Operation == CCB_MODULAR_EXP_CPU_BLOB_CREATION)
           || (Operation == CCB_MODULAR_EXP_BLOB_USE))
  {
    MODIFY_REG(PKA->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE
               | PKA_CR_OPERRIE, CCB_PKA_MODE_MODULAR_EXP_PROTECT << PKA_CR_MODE_Pos);
  }
  else
  {
    /* do nothing */
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Unprotected PKA Initialization
  * @retval HAL status.
  */
static HAL_StatusTypeDef Unprotected_PKA_Init(void)
{
  uint32_t tickstart = HAL_GetTick();

  /* Reset the control register and enable the PKA (wait the end of PKA RAM erase) */
  while ((PKA->CR & PKA_CR_EN) != PKA_CR_EN)
  {
    PKA->CR = PKA_CR_EN;

    /* Check the Timeout */
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set timeout status */
      break;
    }
  }
  /* Wait the INITOK flag Setting */
  if (Unprotect_PKA_WaitFLAG(PKA_SR_INITOK, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Reset any pending flag */
  SET_BIT(PKA->CLRFR, PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  return HAL_OK;
}

/**
  * @brief  Initialize the RNG
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_RNG_Init(void)
{
  uint32_t tickstart;

  /* Disable RNG */
  RNG->CR &= ~RNG_CR_RNGEN;

  /* Clock Error Detection Configuration when CONDRT bit is set to 1 */
  MODIFY_REG(RNG->CR, RNG_CR_CONDRST,  RNG_CR_CONDRST);
#if defined(RNG_CR_NIST_VALUE)
  /* Recommended value for NIST compliance, refer to application note AN4230 */
  WRITE_REG(RNG->CR, RNG_CR_NIST_VALUE | RNG_CR_CONDRST);
#endif /* defined(RNG_CR_NIST_VALUE) */
#if defined(RNG_HTCR_NIST_VALUE)
  /* Recommended value for NIST compliance, refer to application note AN4230 */
  WRITE_REG(RNG->HTCR, RNG_HTCR_NIST_VALUE);
#endif /* defined(RNG_HTCR_NIST_VALUE) */
#if defined(RNG_NSCR_NIST_VALUE)
  WRITE_REG(RNG->NSCR, RNG_NSCR_NIST_VALUE);
#endif /* defined(RNG_NSCR_NIST_VALUE) */

  /* Writing bit CONDRST=0 */
  CLEAR_BIT(RNG->CR, RNG_CR_CONDRST);

  /* Get tick */
  tickstart = HAL_GetTick();

  /* Wait for conditioning reset process to be completed */
  while (HAL_IS_BIT_SET(RNG->CR, RNG_CR_CONDRST))
  {
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* New check to avoid false timeout detection in case of preemption */
      if (HAL_IS_BIT_SET(RNG->CR, RNG_CR_CONDRST))
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }
  }

  /* Enable the RNG Peripheral */
  RNG->CR |=  RNG_CR_RNGEN;

  /* verify that no seed error */
  if ((RNG->SR & (RNG_SR_SEIS)) != (uint32_t)RESET)
  {
    /* Set state and return error */
    return HAL_ERROR;
  }

  /* Check if data register contains valid random data */
  if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Wait CCB wrapping key configuration
  * @param  hccb CCB handle
  * @param  Operation Operation
  * @param  pWrappingKey pointer to the wrapping key structure
  * @retval HAL status
  */
static HAL_StatusTypeDef WrappingKeyConfiguration(CCB_HandleTypeDef *hccb, uint32_t Operation,
                                                  CCB_WrappingKeyTypeDef *pWrappingKey)
{
  uint32_t tmp;

  switch (pWrappingKey->WrappingKeyType)
  {
    case HAL_CCB_USER_KEY_WRAPPED:

      if (Protect_SAES_UnwrapKey(hccb, pWrappingKey, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }

      if ((Operation == CCB_ECDSA_SIGN_CPU_BLOB_CREATION) || (Operation == CCB_ECDSA_SIGN_RNG_BLOB_CREATION)
          || (Operation == CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION)
          || (Operation == CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION)
          || (Operation == CCB_MODULAR_EXP_CPU_BLOB_CREATION))
      {
        /* SAES: GCMPH = 0x0 (initial phase) as event that trig OPSTEP 0x1 --> 0x2 */
        WRITE_REG(SAES->CR, AES_CR_KEYSIZE | AES_CR_CHMOD_0 | AES_CR_CHMOD_1);
      }

      else if ((Operation == CCB_ECDSA_SIGN_BLOB_USE) || (Operation == CCB_ECC_SCALAR_MUL_BLOB_USE)
               || (Operation == CCB_MODULAR_EXP_BLOB_USE))
      {
        /* SAES: GCMPH = 0x0 (initial phase) as event that trig OPSTEP 0x1 --> 0x12 */
        WRITE_REG(SAES->CR, AES_CR_KEYSIZE | AES_CR_CHMOD_0
                  | AES_CR_CHMOD_1 | AES_CR_MODE_1);
      }

      else
      {
        /* do nothing */
      }
      break;

    case HAL_CCB_USER_KEY_HW:

      if ((Operation == CCB_ECDSA_SIGN_CPU_BLOB_CREATION) || (Operation == CCB_ECDSA_SIGN_RNG_BLOB_CREATION)
          || (Operation == CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION)
          || (Operation == CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION)
          || (Operation == CCB_MODULAR_EXP_CPU_BLOB_CREATION))
      {
        /* SAES: GCMPH = 0x0 (initial phase) as event that trig OPSTEP 0x1 --> 0x2 */
        WRITE_REG(SAES->CR, AES_CR_KEYSEL_0 | AES_CR_KEYSIZE | AES_CR_CHMOD_0
                  | AES_CR_CHMOD_1);
      }

      else if ((Operation == CCB_ECDSA_SIGN_BLOB_USE) || (Operation == CCB_ECC_SCALAR_MUL_BLOB_USE)
               || (Operation == CCB_MODULAR_EXP_BLOB_USE))
      {
        /* SAES: GCMPH = 0x0 (initial phase) as event that trig OPSTEP 0x1 --> 0x12 */
        WRITE_REG(SAES->CR, AES_CR_KEYSEL_0 | AES_CR_KEYSIZE | AES_CR_CHMOD_0
                  | AES_CR_CHMOD_1 | AES_CR_MODE_1);
      }

      else
      {
        /* Do nothing */
      }

