stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
      /* Wait for Key valid to be set */
      if (Protect_SAES_WaitFLAG(hccb, AES_SR_KEYVALID, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }

      else
      {
        /* do nothing */
      }
      break;

    case HAL_CCB_USER_KEY_HSW:

      if ((Operation == CCB_ECDSA_SIGN_CPU_BLOB_CREATION) || (Operation == CCB_ECDSA_SIGN_RNG_BLOB_CREATION)
          || (Operation == CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION)
          || (Operation == CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION)
          || (Operation == CCB_MODULAR_EXP_CPU_BLOB_CREATION))
      {
        /* SAES: GCMPH = 0x0 (initial phase) as event that trig OPSTEP 0x1 --> 0x2 */
        WRITE_REG(SAES->CR, AES_CR_KEYSEL_0 | AES_CR_KEYSIZE | AES_CR_CHMOD_0
                  | AES_CR_CHMOD_1);
      }

      else if ((Operation == CCB_ECDSA_SIGN_BLOB_USE) || (Operation == CCB_ECC_SCALAR_MUL_BLOB_USE)
               || (Operation == CCB_MODULAR_EXP_BLOB_USE))
      {
        /* SAES: GCMPH = 0x0 (initial phase) as event that trig OPSTEP 0x1 --> 0x12 */
        WRITE_REG(SAES->CR, AES_CR_KEYSEL_0 | AES_CR_KEYSIZE | AES_CR_CHMOD_0 |
                  AES_CR_CHMOD_1 | AES_CR_MODE_1);
      }

      else
      {
        /* Do nothing */
      }

      /* Wait for Key valid to be set */
      if (Protect_SAES_WaitFLAG(hccb, AES_SR_KEYVALID, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }

      else
      {
        /* do nothing */
      }

      /*we need to read BKP register from TAMP to transfer SW Key to the SAES where
      it will be XOR with HW key, new key in SAES register*/
      for (uint32_t k = 0UL; k < 8UL; k++)
      {
        /* Determine address of the specified Backup register */
        tmp = (uint32_t)(&(TAMP->BKP0R));
        tmp += (k * 4UL);

        /* Read the data from the specified register */
        if ((*(__IO uint32_t *)tmp) != 0UL)
        {
          /* Set state, error code and return error */
          hccb->State = HAL_CCB_STATE_ERROR;
          hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
          return HAL_ERROR;
        }
      }
      break;

    default :
      return HAL_ERROR;
      break;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Unwrap SAES key
  * @param  hccb CCB handle
  * @param  pWrappingKey pointer to the wrapping key structure
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
static HAL_StatusTypeDef Protect_SAES_UnwrapKey(CCB_HandleTypeDef *hccb, const CCB_WrappingKeyTypeDef *pWrappingKey,
                                                uint32_t Timeout)
{
  uint32_t in_count = 0UL;
  uint32_t tickstart = HAL_GetTick()  ;

  if (pWrappingKey->AES_Algorithm != CCB_AES_ECB)
  {
    WRITE_REG(SAES->CR, AES_CR_KEYSEL_0 | AES_CR_KMOD_0 | AES_CR_KEYSIZE | AES_CR_CHMOD_0);
  }
  else
  {
    WRITE_REG(SAES->CR, AES_CR_KEYSEL_0 | AES_CR_KMOD_0 | AES_CR_KEYSIZE);
  }

  /* Wait for Key valid to be set */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_KEYVALID, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Disable the SAES peripheral */
  SAES->CR &=  ~AES_CR_EN;

  /* wait for key valid */
  while (HAL_IS_BIT_CLR(SAES->SR, AES_SR_KEYVALID))
  {
    if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
    {
      SAES->CR &= ~AES_CR_EN;

      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }
  }

  /* Set the operating mode*/
  MODIFY_REG(SAES->CR, AES_CR_KMOD, AES_CR_KMOD_0);

  /* key preparation for decryption, operating mode 2*/
  MODIFY_REG(SAES->CR, AES_CR_MODE, AES_CR_MODE_0);

  /* Enable SAES */
  SAES->CR |= AES_CR_EN;

  /* wait  CCF in SAES */
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Return to decryption operating mode(Mode 3)*/
  MODIFY_REG(SAES->CR, AES_CR_MODE, AES_CR_MODE_1);

  if (pWrappingKey->AES_Algorithm != CCB_AES_ECB)
  {
    /* Set the Initialization Vector */
    SAES->IVR3 = *(uint32_t *)(pWrappingKey->pInitVect);
    SAES->IVR2 = *(uint32_t *)(pWrappingKey->pInitVect + 1U);
    SAES->IVR1 = *(uint32_t *)(pWrappingKey->pInitVect + 2U);
    SAES->IVR0 = *(uint32_t *)(pWrappingKey->pInitVect + 3U);
  }
  /* Enable CRYP */
  SAES->CR |= AES_CR_EN;

  /* Set the phase */
  while (in_count < 8UL) /* symmetric key size is always 256 */
  {
    /* Write four times to input the key to encrypt */
    SAES->DINR  = pWrappingKey->pUserWrappedWrappingKey[in_count];
    in_count++;
    SAES->DINR  = pWrappingKey->pUserWrappedWrappingKey[in_count];
    in_count++;
    SAES->DINR  = pWrappingKey->pUserWrappedWrappingKey[in_count];
    in_count++;
    SAES->DINR  = pWrappingKey->pUserWrappedWrappingKey[in_count];
    in_count++;

    /* wait  CCF in SAES */
    if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }
  }

  /* Disable the SAES */
  SAES->CR &=  ~AES_CR_EN;
  SAES->ICR |=  0x0EUL;

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Get optimal number of bits inside an array of u8
  * @param  byteNumber Number of u8 inside the array
  * @param  msb Most significant uint8_t of the array
  */
static uint32_t GetOptBitSize_u8(uint32_t byteNumber, uint8_t msb)
{
  uint32_t position;

  position = 32UL - __CLZ(msb);

  return (((byteNumber - 1UL) * 8UL) + position);
}

/**
  * @brief  Copy uint32_t array to uint8_t array to fit PKA number representation.
  * @param  dst Pointer to destination
  * @param  src Pointer to source
  * @param  n Number of uint8_t to copy
  * @retval None.
  */
static void CCB_Memcpy_u32_to_u8(uint8_t dst[], __IO const uint32_t src[], size_t n)
{
  uint32_t index_uint32_t = 0UL; /* This index is used outside of the loop */

  for (; index_uint32_t < (n / 4UL); index_uint32_t++)
  {
    /* Avoid casting from uint8_t* to uint32_t* by copying 4 uint8_t in a row */
    /* Apply __REV equivalent */
    uint32_t index_uint8_t = n - 4UL - (index_uint32_t * 4UL);
    dst[index_uint8_t + 3UL] = (uint8_t)((src[index_uint32_t] & 0x000000FFU));
    dst[index_uint8_t + 2UL] = (uint8_t)((src[index_uint32_t] & 0x0000FF00U) >> 8UL);
    dst[index_uint8_t + 1UL] = (uint8_t)((src[index_uint32_t] & 0x00FF0000U) >> 16UL);
    dst[index_uint8_t + 0UL] = (uint8_t)((src[index_uint32_t] & 0xFF000000U) >> 24UL);
  }

  /* Manage the buffers not aligned on uint32_t */
  if ((n % 4UL) == 1UL)
  {
    dst[0UL] = (uint8_t)((src[index_uint32_t] & 0x000000FFU));
  }
  else if ((n % 4UL) == 2UL)
  {
    dst[1UL] = (uint8_t)((src[index_uint32_t] & 0x000000FFU));
    dst[0UL] = (uint8_t)((src[index_uint32_t] & 0x0000FF00U) >> 8UL);
  }
  else if ((n % 4UL) == 3UL)
  {
    dst[2UL] = (uint8_t)((src[index_uint32_t] & 0x000000FFU));
    dst[1UL] = (uint8_t)((src[index_uint32_t] & 0x0000FF00U) >> 8UL);
    dst[0UL] = (uint8_t)((src[index_uint32_t] & 0x00FF0000U) >> 16UL);
  }
  else
  {
    /* The last element is already handle in the loop */
  }
}

/**
  * @brief  Copy uint8_t array to uint32_t array to fit number representation
  * @param  dst Pointer to destination
  * @param  src Pointer to source
  * @param  size Number of uint8_t to copy (must be multiple of 4)
  * @retval None.
  */
static void CCB_Memcpy_u8_to_u32(__IO uint32_t dst[], const uint8_t src[], size_t size)
{
  uint32_t index = 0UL;

