stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
    /* ciphred data size*/
    last_block[3] = cipherkey_size * 32UL;
  }

  else if ((Operation == CCB_ECDSA_SIGN_CPU_BLOB_CREATION) || (Operation == CCB_ECDSA_SIGN_RNG_BLOB_CREATION))
  {
    /* bitsize of |a|, b, p, n, Gx and Gy --> sizeparam*8*6*2 (address and data); n length,
    plength and a sign --> 64*3*2 (address and data) */
    last_block[1] = (((operand_size * 32UL) * 6UL) + (3UL * 64UL)) * 2UL;

    /* 1 ciphred data with 256 size*/
    last_block[3] = cipherkey_size * 32UL;
  }
  else
  {
    /* bitsize of |a|, b, p, n, --> sizeparam*8*4*2 (address and data); n length,
    plength and a sign --> 64*3*2 (address and data) */

    last_block[1] = (((operand_size * 32UL) * 4UL) + (3UL * 64UL)) * 2UL;

    /* 1 ciphred data with 256 size*/
    last_block[3] = cipherkey_size * 32UL;
  }

  for (count = 0; count < CCB_BLOCK_SIZE; count++)
  {
    SAES->DINR = last_block[count];
  }

  /* Wait until CCF flag is SET in SAES */
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Read Authentif Tag */
  for (count = 0U; count < CCB_BLOCK_SIZE; count++)
  {
    pTag[count] = SAES->DOUTR;
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Final phase processing when blob use
  * @param  hccb CCB handle
  * @param  Operation Operation
  * @param  sizeparam size of parameters
  * @retval HAL status
  */
static HAL_StatusTypeDef CCB_BlobUse_FinalPhase(CCB_HandleTypeDef *hccb, uint32_t Operation, uint32_t sizeparam)
{
  uint32_t last_block[4] = {0};
  uint16_t count;
  uint32_t operand_size;
  uint32_t cipherkey_size;

  /* set operand size in 32bits */
  operand_size   = 2UL * ((uint32_t)(((sizeparam) + 7UL) / 8UL) + 1UL);
  if ((operand_size % 4UL) != 0UL)
  {
    cipherkey_size = operand_size - 2UL;
  }
  else
  {
    cipherkey_size = operand_size;
  }

  /* Set SAES GCMPH final phase */
  MODIFY_REG(SAES->CR, AES_CR_GCMPH, AES_CR_GCMPH_0 | AES_CR_GCMPH_1);

  /* Preparing last Block */
  if (Operation == CCB_MODULAR_EXP_BLOB_USE)
  {
    /* bitsize of exp length, modulus n length  and modulus (address and data)*/
    last_block[1] = ((64UL * 2UL) + (operand_size * 32UL)) * 2UL;

    /* ciphred data size*/
    last_block[3] = cipherkey_size * 32UL;
  }

  else if (Operation == CCB_ECDSA_SIGN_BLOB_USE)
  {
    /* bitsize of |a|, b, p, n, Gx and Gy --> sizeparam*8*6*2 (address and data); n length,
    plength and a sign --> 64*3*2 (address and data) */
    last_block[1] = (((operand_size * 32UL) * 6UL) + (3UL * 64UL)) * 2UL;

    /* 1 ciphred data with 256 size*/
    last_block[3] = cipherkey_size * 32UL;
  }
  else
  {
    /* bitsize of |a|, b, p, n, --> sizeparam*8*4*2 (address and data); n length,
    plength and a sign --> 64*3*2 (address and data) */

    last_block[1] = (((operand_size * 32UL) * 4UL) + (3UL * 64UL)) * 2UL;

    /* 1 ciphred data with 256 size*/
    last_block[3] = cipherkey_size * 32UL;
  }

  for (count = 0U; count < CCB_BLOCK_SIZE; count++)
  {
    SAES->DINR = last_block[count];
  }

  /* Wait until CCF flag is SET in SAES  */
  if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  /* Read Authentif Tag and check integrity of Blob as event that trig OPSTEP transition 0x17 --> 0x18 */
  for (count = 0U; count < CCB_BLOCK_SIZE; count++)
  {
    if ((SAES->DOUTR) != 0UL)
    {
      /* Set state, error code and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      hccb->ErrorCode = HAL_CCB_ERROR_OPERATION;
      return HAL_ERROR;
    }
  }

  /* Return function status */
  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECDSA Signature Creation.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pClearPrivateKey pointer to the clear private key.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pIV pointer to the IV.
  * @param  pTag pointer to the Tag.
  * @param  pWarappedKey pointer to the Warapped Key.
  * @param  CCB_Operation is the CCB Operations.
  * @retval HAL status.
  */
static HAL_StatusTypeDef CCB_ECDSA_SignBlobCreation(CCB_HandleTypeDef *hccb, CCB_ECDSACurveParamTypeDef *pCurveParam,
                                                    const uint8_t *pClearPrivateKey,
                                                    CCB_WrappingKeyTypeDef *pWrappingKey, uint32_t *pIV,
                                                    uint32_t *pTag, uint32_t *pWarappedKey, uint8_t CCB_Operation)
{
  uint16_t count;
  uint32_t countBlock = 0UL;
  uint32_t offset;
  uint32_t operand_size;
  uint32_t cipherkey_size;

  /* Set Operation in CCB */
  MODIFY_REG(CCB->CR, CCB_CR_CCOP, CCB_Operation);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Initialize RNG */
  if (CCB_RNG_Init() != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Initialize PKA */
  if (Protect_PKA_Init(hccb, CCB_Operation) != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /*  Initialize SAES */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* Disable the SAES peripheral clock */
    SAES->CR &=  ~AES_CR_EN;

    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  /* Update the state */
  hccb->State = HAL_CCB_STATE_BUSY;

  /* Wrapping Key configuration */
  if (WrappingKeyConfiguration(hccb, CCB_Operation, pWrappingKey) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x02 */
  if (CCB_WaitOperStep(hccb, 0x02, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Update the state */
  hccb->State = HAL_CCB_STATE_BUSY;

  /* set operand size (in word 32bits)*/

