stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  operand_size   = 2UL * ((uint32_t)(((pCurveParam->modulusSizeByte) + 7UL) / 8UL) + 1UL);

  if ((operand_size % 4UL) != 0UL)
  {
    cipherkey_size = operand_size - 2UL;
  }
  else
  {
    cipherkey_size = operand_size;
  }
  /* Initial Phase processing */
  if (CCB_BlobCreation_InitialPhase(hccb, pIV) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x03 */
  if (CCB_WaitOperStep(hccb, 0x03, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Set ECDSA parameters */
  if (CCB_ECDSASign_SetPram(hccb, pCurveParam) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x3 --> 0x4 */
  MODIFY_REG(SAES->CR, AES_CR_GCMPH, AES_CR_GCMPH_1);

  if (CCB_Operation == CCB_ECDSA_SIGN_CPU_BLOB_CREATION)
  {
    /* Wait until OPSTEP is set to 0x04 */
    if (CCB_WaitOperStep(hccb, 0x04, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
    HAL_CCB_CLEAR_PKA_FLAG(PKA_CLRFR_CMFC);

    /* Write private Key d by CPU  (user key) */
    if ((pCurveParam->modulusSizeByte % 8UL) != 0UL)
    {
      for (offset = 0UL; offset < (operand_size - 4UL); offset += 2UL)
      {
        CCB_Memcpy_u8_to_u64(&PKA->RAM[PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + offset],
                             &pClearPrivateKey[(pCurveParam->modulusSizeByte) - ((offset * 4UL) + 1UL)]);
      }

      CCB_Memcpy_Not_Align(&PKA->RAM[PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + offset],
                           &pClearPrivateKey[(pCurveParam->modulusSizeByte) - ((offset * 4UL) + 1UL)],
                           pCurveParam->modulusSizeByte % 8UL);
      RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + offset + 2UL);
    }
    else
    {
      for (offset = 0UL; offset < (operand_size - 2UL); offset += 2UL)
      {
        CCB_Memcpy_u8_to_u64(&PKA->RAM[PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + offset],
                             &pClearPrivateKey[(pCurveParam->modulusSizeByte) - ((offset * 4UL) + 1UL)]);
      }

      RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + offset);
    }
    /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x4 --> 0x8 */
    if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }
  else if (CCB_Operation == CCB_ECDSA_SIGN_RNG_BLOB_CREATION)
  {
    /* Wait until OPSTEP is set to 0x6 */
    if (CCB_WaitOperStep(hccb, 0x06, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
    HAL_CCB_CLEAR_PKA_FLAG(PKA_CLRFR_CMFC);

    /* Write private d Key from RNG */

    for (offset = 0UL; offset < (operand_size - 2UL); offset++)
    {
      if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }
      PKA->RAM[PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + offset] = CCB_FAKE_VALUE;
    }

    RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D
                  + offset);

    /* Check RNG Error Flag in PKA */
    if (HAL_CCB_GET_PKA_FLAG(PKA_SR_RNGERRF) != RESET)
    {
      /* Set state and  return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /* Wait until RNGOKF flag is SET in PKA and trig OPSTEP transition 0x6 --> 0x8 */
    if (Protect_PKA_WaitFLAG(hccb, PKA_SR_RNGOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }
  else
  {
    /* Nothing To Do */
  }

  /* Wait until OPSTEP is set to 0x08 */
  if (CCB_WaitOperStep(hccb, 0x08, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
  HAL_CCB_CLEAR_PKA_FLAG(PKA_CLRFR_CMFC);

  /* Read clear-text private key d for encryption */
  for (offset = 0; offset < cipherkey_size; offset++)
  {
    PKA->RAM[PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D + offset] = CCB_MAGIC_VALUE;

    if ((offset % 4UL) == 3UL)
    {
      /* Wait until CCF flag is SET in SAES*/
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }

      /* Read ciphered private Key d */
      for (count = 0U; count < CCB_BLOCK_SIZE; count++)
      {
        pWarappedKey[cipherkey_size - (countBlock + count + 1UL)]
          = READ_REG(SAES->DOUTR);
      }
      countBlock += 4UL;
    }
  }

  /* Wait for Galois Filter End of Computation */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  if ((operand_size % 4UL) != 0UL)
  {
    RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_PRIVATE_KEY_D
                  + cipherkey_size);
  }
  /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x08 --> 0x09 */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Set SAES GCMPH final phase */
  MODIFY_REG(SAES->CR, AES_CR_GCMPH, AES_CR_GCMPH_0 | AES_CR_GCMPH_1);

  /* Wait until OPSTEP is set to 0x0A */
  if (CCB_WaitOperStep(hccb, 0x0A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Final phase processing */
  if (CCB_BlobCreation_FinalPhase(hccb, CCB_Operation, pTag,
                                  pCurveParam->modulusSizeByte) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }


  /* CCB IPRST set */
  SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* CCB is busy while CCB IPRST is in progress */
  if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return timeout*/
    return HAL_TIMEOUT;
  }

