stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  /* clear CCB IPRST */
  CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}


/**
  * @brief  Blob Creation: ECC generate (by RNG) and wrap the private Key (no user input).
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pClearPrivateKey pointer to the related wrapped Private Key Blob.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  WarappedKey pointer to the related wrapped Private Key Blob.
  * @param  CCB_Operation is the CCB Operations.
  * @retval HAL status.
  */
static HAL_StatusTypeDef CCB_ECC_ScalarMulBlobCreation(CCB_HandleTypeDef *hccb,
                                                       CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                       const uint8_t *pClearPrivateKey,
                                                       CCB_WrappingKeyTypeDef *pWrappingKey,
                                                       uint32_t *IV, uint32_t *Tag, uint32_t *WarappedKey,
                                                       uint8_t CCB_Operation)
{
  uint16_t count;
  uint32_t countBlock = 0UL;
  uint32_t offset;
  uint32_t operand_size;
  uint32_t cipherkey_size;

  if (hccb->State == HAL_CCB_STATE_READY)
  {
    /* Set Operation in CCB */
    MODIFY_REG(CCB->CR, CCB_CR_CCOP, CCB_Operation);

    /* Wait until OPSTEP is set to 0x01 */
    if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Initialize RNG */
    if (CCB_RNG_Init() != HAL_OK)
    {
      /* return state and error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /* Initialize PKA */
    if (Protect_PKA_Init(hccb, CCB_Operation) != HAL_OK)
    {
      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /*  Initialize SAES */
    if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* Disable the SAES peripheral clock */
      SAES->CR &=  ~AES_CR_EN;

      /* Set state and return error */
      hccb->State = HAL_CCB_STATE_ERROR;
      return HAL_ERROR;
    }

    /* Update the state */
    hccb->State = HAL_CCB_STATE_BUSY;

    /* Wrapping Key configuration */
    if (WrappingKeyConfiguration(hccb, CCB_Operation, pWrappingKey) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Wait until OPSTEP is set to 0x02 */
    if (CCB_WaitOperStep(hccb, 0x02, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Update the state */
    hccb->State = HAL_CCB_STATE_BUSY;

    /* set operand size */
    operand_size   = 2UL * ((uint32_t)(((pCurveParam->primeOrderSizeByte) + 7UL) / 8UL) + 1UL);
    if ((operand_size % 4UL) != 0UL)
    {
      cipherkey_size = operand_size - 2UL;
    }
    else
    {
      cipherkey_size = operand_size;
    }

    /* Initial Phase processing */
    if (CCB_BlobCreation_InitialPhase(hccb, IV) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Wait until OPSTEP is set to 0x03 */
    if (CCB_WaitOperStep(hccb, 0x03, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Set ECC Scalar multiplications parameters */
    if (CCB_ECCMul_SetPram(hccb, pCurveParam) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x3 --> 0x4 */
    MODIFY_REG(SAES->CR, AES_CR_GCMPH, AES_CR_GCMPH_1);

    /* Wait until OPSTEP is set to 0x04 */
    if (CCB_WaitOperStep(hccb, 0x04, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
    HAL_CCB_CLEAR_PKA_FLAG(PKA_CLRFR_CMFC);

    if (CCB_Operation == CCB_ECC_SCALAR_MUL_CPU_BLOB_CREATION)
    {

      /* Write clear scalar k by CPU */
      if ((pCurveParam->modulusSizeByte % 8UL) != 0UL)
      {
        for (offset = 0UL; offset < (operand_size - 4UL); offset += 2UL)
        {
          CCB_Memcpy_u8_to_u64(&PKA->RAM[PKA_ECC_SCALAR_MUL_IN_K + offset],
                               &pClearPrivateKey[(pCurveParam->modulusSizeByte) - ((offset * 4UL) + 1UL)]);
        }

        CCB_Memcpy_Not_Align(&PKA->RAM[PKA_ECC_SCALAR_MUL_IN_K + offset],
                             &pClearPrivateKey[(pCurveParam->modulusSizeByte) - ((offset * 4UL) + 1UL)],
                             pCurveParam->modulusSizeByte % 8UL);
        RAM_PARAM_END(PKA->RAM, PKA_ECC_SCALAR_MUL_IN_K + offset + 2UL);
      }
      else
      {
        for (offset = 0UL; offset < (operand_size - 2UL); offset += 2UL)
        {
          CCB_Memcpy_u8_to_u64(&PKA->RAM[PKA_ECC_SCALAR_MUL_IN_K + offset],
                               &pClearPrivateKey[(pCurveParam->modulusSizeByte) - ((offset * 4UL) + 1UL)]);
        }

        RAM_PARAM_END(PKA->RAM, PKA_ECC_SCALAR_MUL_IN_K + offset);
      }
      /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x4 --> 0x8 */
      if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }
    }
    else if (CCB_Operation == CCB_ECC_SCALAR_MUL_RNG_BLOB_CREATION)
    {
      /* Write scalar k when RNG */
      for (offset = 0UL; offset < (operand_size - 2UL); offset++)
      {
        if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
        {
          /* return error */
          return HAL_ERROR;
        }
        PKA->RAM[PKA_ECC_SCALAR_MUL_IN_K + offset] = CCB_FAKE_VALUE;
      }
      RAM_PARAM_END(PKA->RAM, PKA_ECC_SCALAR_MUL_IN_K + offset);

      /* PKA: Check RNG Error Flag */
      if (HAL_CCB_GET_PKA_FLAG(PKA_SR_RNGERRF) != RESET)
      {
        /* Set state and return error */
        hccb->State = HAL_CCB_STATE_ERROR;
        return HAL_ERROR;
      }

      /* Wait until RNGOKF flag is SET in PKA and trig OPSTEP transition 0x6 --> 0x8 */
      if (Protect_PKA_WaitFLAG(hccb, PKA_SR_RNGOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }
    }
    else
    {
      /* Nothing To Do */
    }

