stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
    /* Wait until OPSTEP is set to 0x08 */
    if (CCB_WaitOperStep(hccb, 0x08, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Clear the CMF flag and the chaining mode status bits in 8 to 15 in PKA_SR */
    HAL_CCB_CLEAR_PKA_FLAG(PKA_CLRFR_CMFC);

    /* Read clear-text scalar K for encryption */
    for (offset = 0; offset < cipherkey_size; offset++)
    {

      PKA->RAM[PKA_ECC_SCALAR_MUL_IN_K + offset] = CCB_MAGIC_VALUE;

      if ((offset % 4UL) == 3UL)
      {
        /* Wait until CCF flag is SET in SAES*/
        if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
        {
          /* return error */
          return HAL_ERROR;
        }

        /* Read ciphered scalar k */
        for (count = 0U; count < CCB_BLOCK_SIZE; count++)
        {
          WarappedKey[cipherkey_size - (countBlock + count + 1U)]
            = READ_REG(SAES->DOUTR);
        }
        countBlock += 4UL;
      }
    }

    /* Wait for Galois Filter End of Computation */
    if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    if ((operand_size % 4UL) != 0UL)
    {
      RAM_PARAM_END(PKA->RAM, PKA_ECC_SCALAR_MUL_IN_K
                    + cipherkey_size);
    }

    /* Wait until DATAOKF flag is SET in PKA and trig OPSTEP transition 0x8 --> 0xA */
    if (Protect_PKA_WaitFLAG(hccb, PKA_SR_DATAOKF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Set SAES GCMPH final phase */
    MODIFY_REG(SAES->CR, AES_CR_GCMPH, AES_CR_GCMPH_0 | AES_CR_GCMPH_1);

    /* Wait until OPSTEP is set to 0x0A */
    if (CCB_WaitOperStep(hccb, 0x0A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }

    /* Final phase processing */
    if (CCB_BlobCreation_FinalPhase(hccb, CCB_Operation, Tag,
                                    pCurveParam->modulusSizeByte) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }


    /* CCB IPRST set */
    SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

    /* CCB is busy while CCB IPRST is in progress */
    if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_TIMEOUT;
    }

    /* clear CCB IPRST */
    CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

    /* Update the CCB state */
    hccb->State = HAL_CCB_STATE_READY;
  }

  else
  {
    /* Set state, error code and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    hccb->ErrorCode = HAL_CCB_ERROR_INVALID_PARAM;
    return HAL_ERROR;
  }

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Blob Usage: ECC Compute Scalar Multiplication.
  * @param  hccb CCB handle.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pWrappingKey pointer to the Wrapping Key structure.
  * @param  pIV pointer to the IV.
  * @param  pTag pointer to the Tag.
  * @param  pWarappedKey pointer to the Warapped Key.
  * @param  pInputPoint pointer to the input point structure.
  * @param  pOutputPoint pointer to the output point.
  * @param  pPublicKey pointer to the input public key for check.
  * @param  VerifOperation allows to compare the OutputPoint with the Publickey.
  * @retval HAL status.
  */
static HAL_StatusTypeDef CCB_ECC_ComputeScalarMul(CCB_HandleTypeDef *hccb, CCB_ECCMulCurveParamTypeDef *pCurveParam,
                                                  CCB_WrappingKeyTypeDef *pWrappingKey,
                                                  uint32_t *pIV, uint32_t *pTag, uint32_t *pWarappedKey,
                                                  CCB_ECCMulPointTypeDef *pInputPoint,
                                                  CCB_ECCMulPointTypeDef *pOutputPoint,
                                                  const uint32_t *pPublicKey,
                                                  uint8_t VerifOperation)
{
  __IO uint16_t f_count;
  uint16_t random1 = 0;
  uint16_t random2 = 0;
  uint16_t random3 = 0;
  uint16_t count_ram;
  uint32_t count_block = 0UL;
  uint32_t offset;
  uint32_t operand_size;
  uint32_t cipherkey_size;
  uint32_t tickstart;

  /* Set Operation in CCB */
  MODIFY_REG(CCB->CR, CCB_CR_CCOP, CCB_ECC_SCALAR_MUL_BLOB_USE);

  /* Wait until OPSTEP is set to 0x01 */
  if (CCB_WaitOperStep(hccb, 0x01, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Initialize RNG */
  if (CCB_RNG_Init() != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random1 == 0U)
  {
    random1 = (uint16_t)(RNG->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random2 == 0U)
  {
    random2 = (uint16_t)(RNG->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_ERROR;
  }

  tickstart = HAL_GetTick();

  while (random3 == 0U)
  {
    random3 = (uint16_t)(RNG->DR & 0x3FFU);
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Set state and return error */
      return HAL_ERROR;
    }
  }

  /* Initialize PKA */
  if (Protect_PKA_Init(hccb, CCB_ECC_SCALAR_MUL_BLOB_USE) != HAL_OK)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }


  if (VerifOperation == CCB_VERIF_OPERATION_DISABLED)
  {
    /* Write Customized point coordinate */
    CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X ], pInputPoint->pPointX,
                         pCurveParam->modulusSizeByte);
    RAM_PARAM_END(PKA->RAM, PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
    CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y ], pInputPoint->pPointY,
                         pCurveParam->modulusSizeByte);
    RAM_PARAM_END(PKA->RAM, PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
  }
  else if (VerifOperation == CCB_VERIF_OPERATION_ENABLED)
  {
    /* Write  point G coordinate */
    CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X ], pCurveParam->pPointX,
                         pCurveParam->modulusSizeByte);
    RAM_PARAM_END(PKA->RAM, PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
    CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y ], pCurveParam->pPointY,
                         pCurveParam->modulusSizeByte);
    RAM_PARAM_END(PKA->RAM, PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));
  }
  else
  {
    /* nothing to do */
  }

  /*  Initialize SAES */
  if (Protect_SAES_WaitFLAG(hccb, AES_SR_BUSY, RESET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* Disable the SAES peripheral */
    SAES->CR &=  ~AES_CR_EN;

    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

