stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  /* Update the state */
  hccb->State = HAL_CCB_STATE_BUSY;

  /* Wrapping Key configuration */
  if (WrappingKeyConfiguration(hccb, CCB_ECC_SCALAR_MUL_BLOB_USE, pWrappingKey) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x012 */
  if (CCB_WaitOperStep(hccb, 0x012, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Update the state */
  hccb->State = HAL_CCB_STATE_BUSY;

  /* set 32bits word number and operand size*/

  operand_size   = 2UL * ((uint32_t)(((pCurveParam->primeOrderSizeByte) + 7UL) / 8UL) + 1UL);

  if ((operand_size % 4UL) != 0UL)
  {
    cipherkey_size = operand_size - 2UL;
  }
  else
  {
    cipherkey_size = operand_size;
  }

  /* Initial Phase Processing */
  if (CCB_BlobUse_InitialPhase(hccb, pIV, pTag) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x13 */
  if (CCB_WaitOperStep(hccb, 0x13, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  if (VerifOperation == CCB_COMPUTE_PUBLIC_KEY)
  {
    /* Set parameters */
    if (CCB_ECDSASign_SetPram(hccb, pCurveParam) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }
  else
  {
    /* Set parameters */
    if (CCB_ECCMul_SetPram(hccb, pCurveParam) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }

  /* Set SAES GCMPH Payload phase and trig OPSTEP that trig OPSTEP transition 0x13 --> 0x14 */
  MODIFY_REG(SAES->CR, AES_CR_GCMPH, AES_CR_GCMPH_1);

  /* Wait until OPSTEP is set to 0x14 */
  if (CCB_WaitOperStep(hccb, 0x14, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  for (offset = 0UL; offset < cipherkey_size; offset++)
  {
    /* Write Wrapped scalar k in PKA RAM */
    WRITE_REG(SAES->DINR, pWarappedKey[cipherkey_size - (offset + 1UL)]);

    if ((offset % 4UL) == 0x3UL)
    {
      /* Wait until CCF flag is SET in SAES */
      if (Protect_SAES_WaitFLAG(hccb, AES_ISR_CCF, SET, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        /* return error */
        return HAL_ERROR;
      }

      /* Write Unrapped scalar k in PKA RAM */
      for (count_ram = 0U; count_ram < 4U; count_ram++)
      {
        PKA->RAM[PKA_ECDSA_SIGN_IN_K + (count_block + count_ram)] = CCB_MAGIC_VALUE;
      }
      count_block += 4UL;
    }
  }
  if ((operand_size % 4UL) != 0UL)
  {
    RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_K
                  + cipherkey_size);
  }

  /* Wait until OPSTEP is set to 0x17 */
  if (CCB_WaitOperStep(hccb, 0x17, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }
  if (VerifOperation == CCB_COMPUTE_PUBLIC_KEY)
  {
    /* Final phase processing */
    if (CCB_BlobUse_FinalPhase(hccb, CCB_ECDSA_SIGN_BLOB_USE, pCurveParam->modulusSizeByte) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }
  else
  {
    /* Final phase processing */
    if (CCB_BlobUse_FinalPhase(hccb, CCB_ECC_SCALAR_MUL_BLOB_USE, pCurveParam->modulusSizeByte) != HAL_OK)
    {
      /* return error */
      return HAL_ERROR;
    }
  }

  /* Wait until OPSTEP is set to 0x18 */
  if (CCB_WaitOperStep(hccb, 0x18, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* SET PKA START operation bit and trig OPSTEP transition 0x18 --> 0x19 */
  SET_BIT(PKA->CR, PKA_CR_START);

  /* Wait until OPSTEP is set to 0x19 */
  if (CCB_WaitOperStep(hccb, 0x19, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until end of operation flag is SET in PKA and trig OPSTEP transition 0x19 --> 0x1A */
  if (Protect_PKA_WaitFLAG(hccb, PKA_SR_PROCENDF, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Wait until OPSTEP is set to 0x1A */
  if (CCB_WaitOperStep(hccb, 0x1A, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  /* Check PKA Operation error result */
  if ((PKA->RAM[PKA_ECC_SCALAR_MUL_OUT_ERROR]) !=  CCB_PKA_ERROR_OPERATION_NONE)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  if (VerifOperation == CCB_VERIF_OPERATION_DISABLED)
  {
    /* P coordinate x */
    CCB_Memcpy_u32_to_u8(pOutputPoint->pPointX, &PKA->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X],
                         pCurveParam->modulusSizeByte);

    /* P coordinate y */
    CCB_Memcpy_u32_to_u8(pOutputPoint->pPointY, &PKA->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y],
                         pCurveParam->modulusSizeByte);
  }
  else if (VerifOperation == CCB_COMPUTE_PUBLIC_KEY)
  {
    /* P coordinate x */
    CCB_Memcpy_u32_to_u8(pOutputPoint->pPointX, &PKA->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X],
                         pCurveParam->modulusSizeByte);

    /* P coordinate y */
    CCB_Memcpy_u32_to_u8(pOutputPoint->pPointY, &PKA->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y],
                         pCurveParam->modulusSizeByte);
  }
  else /* (VerifOperation == CCB_VERIF_OPERATION_ENABLED) */
  {
    f_count = 0;
    while (f_count < random1)
    {
      f_count++;
    }

    /* P coordinate x */
    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate x and improve robustness against intrusion (intentional) */
      if (((PKA->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X + offset] != pPublicKey[offset]) ||
           (f_count != random1) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    /* P coordinate y */

    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate y and improve robustness against intrusion (intentional) */
      if (((PKA->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y + offset] != pPublicKey[offset + 20U]) ||
           (f_count != random1) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    f_count = 0;
    while (f_count < random2)
    {
      f_count++;
    }

    /* P coordinate x */
    for (offset = 0UL; offset < ((pCurveParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check  public key coordinate x and improve robustness against intrusion (intentional) */
      if (((PKA->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X + offset] != pPublicKey[offset]) ||
           (f_count != random2) || (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    /* P coordinate y */

