stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  /* Check PKA Operation error result */
  if ((PKA->RAM[PKA_MODULAR_EXP_OUT_ERROR]) !=  CCB_PKA_ERROR_OPERATION_NONE)
  {
    /* Set state and return error */
    hccb->State = HAL_CCB_STATE_ERROR;
    return HAL_ERROR;
  }

  if (VerifOperation == CCB_VERIF_OPERATION_DISABLED)
  {
    /* Read result output */
    CCB_Memcpy_u32_to_u8(pModularExp, &PKA->RAM[PKA_MODULAR_EXP_OUT_RESULT], pParam->modulusSizeByte);
  }
  else /* CCB_VERIF_OPERATION_ENABLED */
  {
    f_count = 0;
    while (f_count < random1)
    {
      f_count++;
    }

    for (offset = 0UL; offset < ((pParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check Modular Exponentiation and improve robustness against intrusion (intentional) */
      if (((PKA->RAM[PKA_MODULAR_EXP_OUT_RESULT + offset] != pReferenceModularExp[offset]) || (f_count != random1) ||
           (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }

    }

    f_count = 0;
    while (f_count < random2)
    {
      f_count++;
    }

    for (offset = 0UL; offset < ((pParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check Modular Exponentiation and improve robustness against intrusion (intentional) */
      if (((PKA->RAM[PKA_MODULAR_EXP_OUT_RESULT + offset] != pReferenceModularExp[offset]) || (f_count != random2) ||
           (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }

    f_count = 0;
    while (f_count < random3)
    {
      f_count++;
    }

    for (offset = 0UL; offset < ((pParam->modulusSizeByte + 3UL) / 4UL); offset++)
    {
      /* Check Modular Exponentiation and improve robustness against intrusion (intentional) */
      if (((PKA->RAM[PKA_MODULAR_EXP_OUT_RESULT + offset] != pReferenceModularExp[offset]) || (f_count != random3) ||
           (f_count == 0U)))
      {
        /* Set state, and intrusion error */
        hccb->State = HAL_CCB_STATE_ERROR;
        HAL_CCB_IntrusionCallback(hccb);
      }
    }
  }

  /* CCB IPRST set */
  SET_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* CCB is busy while CCB IPRST is in progress */
  if (CCB_WaitFLAG(hccb, CCB_SR_BUSY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return HAL_TIMEOUT;
  }

  /* clear CCB IPRST */
  CLEAR_BIT(hccb->Instance->CR, CCB_CR_IPRST);

  /* Update the CCB state */
  hccb->State = HAL_CCB_STATE_READY;

  /* Return HAL OK */
  return HAL_OK;
}

/**
  * @brief  Erase the PKA RAM.
  * @retval HAL status.
  */
static HAL_StatusTypeDef PKA_RAM_Erase(void)
{
  uint32_t index;
  __IO uint8_t random_nbr = 0U;
  uint32_t tickstart;

  PKA->RAM[CCB_PKA_RAM_SIZE - 1U] = CCB_MAGIC_VALUE;

  /* For each element in the PKA RAM */
  for (index = 0; index < CCB_PKA_RAM_SIZE; index++)
  {
    if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }
    /* Clear the content */
    PKA->RAM[index] = RNG->DR;
  }

  if (PKA->RAM[CCB_PKA_RAM_SIZE - 1U] == CCB_MAGIC_VALUE)
  {
    if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return HAL_ERROR;
    }

    tickstart = HAL_GetTick();

    while (random_nbr == 0U)
    {
      random_nbr = (uint8_t)(RNG->DR & 0xFFU);
      if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
      {
        /* Set state and return error */
        return HAL_ERROR;
      }
    }

    while (random_nbr != 0UL)
    {
      random_nbr--;
    }

    /* For each element in the PKA RAM */
    for (index = 0; index < CCB_PKA_RAM_SIZE; index++)
    {
      if (CCB_RNG_Wait_SET_FLAG(RNG_SR_DRDY, HAL_CCB_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return HAL_ERROR;
      }
      /* Clear the content */
      PKA->RAM[index] = RNG->DR;
    }

    if (PKA->RAM[CCB_PKA_RAM_SIZE - 1U] == CCB_MAGIC_VALUE)
    {
      return HAL_ERROR;
    }
  }

  /* Return HAL OK */
  return HAL_OK;

}

/**
  * @brief  CCB PKA ECDSA Signature.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pClearPrivateKey pointer to the clear private key.
  * @param  pInteger pointer to the integer k.
  * @param  pHash pointer to the input hash.
  * @param  pSignature Pointer to output signature
  * @retval HAL status.
  */
static HAL_StatusTypeDef PKA_ECDSASign(CCB_ECDSACurveParamTypeDef *pCurveParam,
                                       const uint8_t *pClearPrivateKey, uint8_t *pInteger, uint8_t *pHash,
                                       CCB_ECDSASignTypeDef *pSignature)
{
  uint32_t tickstart;
  uint32_t timeout = HAL_CCB_TIMEOUT_DEFAULT_VALUE;

  /* Get the prime order n length */
  PKA->RAM[PKA_ECDSA_SIGN_IN_ORDER_NB_BITS] = GetOptBitSize_u8(pCurveParam->primeOrderSizeByte,
                                                               *(pCurveParam->pPrimeOrder));

  /* Get the modulus p length */
  PKA->RAM[PKA_ECDSA_SIGN_IN_MOD_NB_BITS] = GetOptBitSize_u8(pCurveParam->modulusSizeByte, *(pCurveParam->pModulus));

  /* Get the coefficient a sign */
  PKA->RAM[PKA_ECDSA_SIGN_IN_A_COEFF_SIGN] = pCurveParam->coefSignA;

  /* Move the input parameters coefficient |a| to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_SIGN_IN_A_COEFF], pCurveParam->pAbsCoefA, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_A_COEFF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters coefficient B to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_SIGN_IN_B_COEFF], pCurveParam->pCoefB, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_B_COEFF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters modulus value p to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_SIGN_IN_MOD_GF], pCurveParam->pModulus, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_MOD_GF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters integer k to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_SIGN_IN_K], pInteger, pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_K + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters base point G coordinate x to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_SIGN_IN_INITIAL_POINT_X], pCurveParam->pPointX,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters base point G coordinate y to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_SIGN_IN_INITIAL_POINT_Y], pCurveParam->pPointY,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters hash of message z to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_SIGN_IN_HASH_E], pHash, pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_SIGN_IN_HASH_E + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

