stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Src/stm32u3xx_hal_ccb.c
  /* Get the number of bit of the exponent */
  PKA->RAM[PKA_MODULAR_EXP_IN_EXP_NB_BITS] = pParam->expSizeByte * 8U;

  /* Move the input parameters pOp1 to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE], pOp1, pParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE + ((pParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the exponent to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_MODULAR_EXP_PROTECT_IN_EXPONENT], pRSAClearPrivateKey->pExp, pParam->expSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_MODULAR_EXP_PROTECT_IN_EXPONENT + ((pParam->expSizeByte + 3UL) / 4UL));

  /* Move the modulus to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_MODULAR_EXP_PROTECT_IN_MODULUS], pParam->pMod, pParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_MODULAR_EXP_PROTECT_IN_MODULUS + ((pParam->modulusSizeByte + 3UL) / 4UL));

  /* Move Phi value to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_MODULAR_EXP_PROTECT_IN_PHI], pRSAClearPrivateKey->pPhi, pParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_MODULAR_EXP_PROTECT_IN_PHI + ((pParam->modulusSizeByte + 3UL) / 4UL));

  /* Set the mode and deactivate the interrupts */
  MODIFY_REG(PKA->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE | PKA_CR_OPERRIE,
             CCB_PKA_MODE_MODULAR_EXP_PROTECT << PKA_CR_MODE_Pos);

  /* Start the computation */
  PKA->CR |= PKA_CR_START;

  /* Wait for the end of operation or timeout */
  while ((PKA->SR & PKA_SR_PROCENDF) == 0UL)
  {
    /* Check if timeout is disabled (set to infinite wait) */
    if ((HAL_GetTick() - tickstart) > HAL_CCB_TIMEOUT_DEFAULT_VALUE)
    {
      /* Abort any ongoing operation */
      CLEAR_BIT(PKA->CR, PKA_CR_EN);
      /* Make ready for the next operation */
      SET_BIT(PKA->CR, PKA_CR_EN);
      return HAL_TIMEOUT;
    }
  }

  /* Clear all flags */
  PKA->CLRFR |= (PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  /* Move the result from appropriate location (with opprand size in 32bit word ) */
  CCB_Memcpy_u32_to_u32(pReferenceModularExp, &PKA->RAM[PKA_MODULAR_EXP_OUT_RESULT],
                        ((pParam->modulusSizeByte + 3UL) / 4UL));

  if (PKA_RAM_Erase() != HAL_OK)
  {
    /* return error */
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
 @brief  Verify the validity of a signature using elliptic curves over prime fields in blocking mode.
  * @param  pCurveParam pointer to the Curve parameters.
  * @param  pPublicKeyOut pointer to the public key.
  * @param  pHash pointer to the hash.
  * @param  pSignature Pointer to input signature
  * @retval HAL status.
  */
static HAL_StatusTypeDef PKA_ECDSAVerif(CCB_ECDSACurveParamTypeDef *pCurveParam,
                                        CCB_ECCMulPointTypeDef *pPublicKeyOut, const uint8_t *pHash,
                                        CCB_ECDSASignTypeDef *pSignature)
{
  uint32_t tickstart;
  uint32_t timeout = HAL_CCB_TIMEOUT_DEFAULT_VALUE;

  /* Set CCB input parameter in PKA RAM */
  /* Get the prime order n length */
  PKA->RAM[PKA_ECDSA_VERIF_IN_ORDER_NB_BITS] = GetOptBitSize_u8(pCurveParam->primeOrderSizeByte,
                                                                *(pCurveParam->pPrimeOrder));

  /* Get the modulus p length */
  PKA->RAM[PKA_ECDSA_VERIF_IN_MOD_NB_BITS] = GetOptBitSize_u8(pCurveParam->modulusSizeByte, *(pCurveParam->pModulus));

  /* Get the coefficient a sign */
  PKA->RAM[PKA_ECDSA_VERIF_IN_A_COEFF_SIGN] = pCurveParam->coefSignA;

  /* Move the input parameters coefficient |a| to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_A_COEFF], pCurveParam->pAbsCoefA, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_A_COEFF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters modulus value p to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_MOD_GF], pCurveParam->pModulus, pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_MOD_GF + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters base point G coordinate x to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_INITIAL_POINT_X], pCurveParam->pPointX,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_INITIAL_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters base point G coordinate y to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y], pCurveParam->pPointY,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters public-key curve point Q coordinate xQ to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X], pPublicKeyOut->pPointX,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters public-key curve point Q coordinate xQ to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y], pPublicKeyOut->pPointY,
                       pCurveParam->modulusSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y + ((pCurveParam->modulusSizeByte + 3UL) / 4UL));

  /* Move the input parameters signature part r to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_SIGNATURE_R], pSignature->pRSign, pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_SIGNATURE_R + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters signature part s to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_SIGNATURE_S], pSignature->pSSign, pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_SIGNATURE_S + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters hash of message z to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_HASH_E], pHash, pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_HASH_E + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));

  /* Move the input parameters curve prime order n to PKA RAM */
  CCB_Memcpy_u8_to_u32(&PKA->RAM[PKA_ECDSA_VERIF_IN_ORDER_N], pCurveParam->pPrimeOrder,
                       pCurveParam->primeOrderSizeByte);
  RAM_PARAM_END(PKA->RAM, PKA_ECDSA_VERIF_IN_ORDER_N + ((pCurveParam->primeOrderSizeByte + 3UL) / 4UL));


  /* Set the mode and deactivate the interrupts */
  MODIFY_REG(PKA->CR, PKA_CR_MODE | PKA_CR_PROCENDIE | PKA_CR_RAMERRIE | PKA_CR_ADDRERRIE | PKA_CR_OPERRIE,
             CCB_PKA_MODE_ECDSA_VERIFICATION << PKA_CR_MODE_Pos);

  /* Start the computation */
  PKA->CR |= PKA_CR_START;

  tickstart = HAL_GetTick();
  /* Wait for the end of operation or timeout */
  while ((PKA->SR & PKA_SR_PROCENDF) == 0UL)
  {
    if (((HAL_GetTick() - tickstart) > timeout) || (timeout == 0UL))
    {
      /* Abort any ongoing operation */
      CLEAR_BIT(PKA->CR, PKA_CR_EN);
      /* Make ready for the next operation */
      SET_BIT(PKA->CR, PKA_CR_EN);
      return HAL_TIMEOUT;
    }
  }

  /* Clear all flags */
  PKA->CLRFR |= (PKA_CLRFR_PROCENDFC | PKA_CLRFR_RAMERRFC | PKA_CLRFR_ADDRERRFC | PKA_CLRFR_OPERRFC);

  return HAL_OK;
}

/**
  * @brief  Return the result of the ECDSA verification operation.
  * @retval 1 if signature is verified, 0 in other case
  */
static uint32_t PKA_ECDSAVerif_Result(void)
{
  return (PKA->RAM[PKA_ECDSA_VERIF_OUT_RESULT]);
}

/**
  * @brief  Reset the PKA RAM.
  * @retval None
  */
static void CCB_PKA_RAMReset(void)
{
  uint32_t index;

  /* For each element in the PKA RAM */
  for (index = 0; index < CCB_PKA_RAM_SIZE; index++)
  {
    /* Clear the content */
    PKA->RAM[index] = 0UL;
  }
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(CCB) && defined(HAL_CCB_MODULE_ENABLED) */
/**
  * @}
  */
